davidjade/FT81x-ESP32/main/EVE_target.h
		#if defined (STM32F1) /* set by PlatformIO board definition file genericSTM32F103C8.json */
		#include "stm32f1xx.h"
		#include "stm32f1xx_hal.h"
		#include "stm32f1xx_ll_spi.h"
		#endif

		#if defined (STM32F207xx) /* set by PlatformIO board definition file nucleo_f207zg.json */
		#include "stm32f2xx.h"
		#include "stm32f2xx_hal.h"
		#include "stm32f2xx_ll_spi.h"
		#endif

		#if defined (STM32F3) /* set by PlatformIO board definition file genericSTM32F303CB.json */
		#include "stm32f3xx.h"
		#include "stm32f3xx_hal.h"
		#include "stm32f3xx_ll_spi.h"
		#endif

		#if defined (STM32F4) /* set by PlatformIO board definition file genericSTM32F407VET6.json */
		#include "stm32f4xx.h"
		#include "stm32f4xx_hal.h"
		#include "stm32f4xx_ll_spi.h"
		#endif


		#define EVE_CS_PORT GPIOD
		#define EVE_CS GPIO_PIN_12
		#define EVE_PDN_PORT GPIOD
		#define EVE_PDN GPIO_PIN_13
		#define EVE_SPI SPI1
		#define EVE_DMA_INSTANCE DMA2
		#define EVE_DMA_CHANNEL 3
		#define EVE_DMA_STREAM 3
//		#define EVE_DMA		/* do not active, it is not working yet */

		#if defined (EVE_DMA)
			extern uint8_t EVE_dma_buffer[4100];
			extern volatile uint16_t EVE_dma_buffer_index;
			extern volatile uint8_t EVE_dma_busy;

			void EVE_init_dma(void);
			void EVE_start_dma_transfer(void);
		#endif

		#define DELAY_MS(ms) HAL_Delay(ms)

		static inline void EVE_pdn_clear(void)
		{
			HAL_GPIO_WritePin(EVE_PDN_PORT, EVE_PDN, GPIO_PIN_SET);
		}

		static inline void EVE_pdn_set(void)
		{
			HAL_GPIO_WritePin(EVE_PDN_PORT, EVE_PDN, GPIO_PIN_RESET);
		}

		static inline void EVE_cs_clear(void)
		{
			HAL_GPIO_WritePin(EVE_CS_PORT, EVE_CS, GPIO_PIN_SET);
		}

		static inline void EVE_cs_set(void)
		{
			HAL_GPIO_WritePin(EVE_CS_PORT, EVE_CS, GPIO_PIN_RESET);
		}

		static inline void spi_transmit(uint8_t data)
		{
			LL_SPI_TransmitData8(EVE_SPI, data);
			while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI));
			while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI));
			LL_SPI_ReceiveData8(EVE_SPI); /* dummy read-access to clear SPI_SR_RXNE */
		}

		static inline void spi_transmit_async(uint8_t data)
		{
			#if defined (EVE_DMA)
				EVE_dma_buffer[EVE_dma_buffer_index++] = data;
			#else
				LL_SPI_TransmitData8(EVE_SPI, data);
				while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI));
				while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI));
				LL_SPI_ReceiveData8(EVE_SPI); /* dummy read-access to clear SPI_SR_RXNE */
			#endif
		}

		static inline uint8_t spi_receive(uint8_t data)
		{
			LL_SPI_TransmitData8(EVE_SPI, data);
			while(!LL_SPI_IsActiveFlag_TXE(EVE_SPI));
			while(!LL_SPI_IsActiveFlag_RXNE(EVE_SPI));
			return LL_SPI_ReceiveData8(EVE_SPI);
		}

		static inline uint8_t fetch_flash_byte(const uint8_t *data)
		{
			return *data;
		}

		#endif  /* STM32 */

	#endif /* __GNUC__ */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

    #if defined (__TI_ARM__)

        #if defined (__MSP432P401R__)

        #include <ti/devices/msp432p4xx/inc/msp.h>
        #include <ti/devices/msp432p4xx/driverlib/driverlib.h>
        #include <stdint.h>

        #define RIVERDI_PORT GPIO_PORT_P1
        #define RIVERDI_SIMO BIT6   // P1.6
        #define RIVERDI_SOMI BIT7   // P1.7
        #define RIVERDI_CLK BIT5    // P1.5
        #define EVE_CS_PORT         GPIO_PORT_P5
        #define EVE_CS              GPIO_PIN0           //P5.0
        #define EVE_PDN_PORT        GPIO_PORT_P5
        #define EVE_PDN             GPIO_PIN1           //P5.1

        void EVE_SPI_Init(void);

        static inline void DELAY_MS(uint16_t val)
        {
            uint16_t counter;

            while(val > 0)
            {
                for(counter=0; counter < 8000;counter++) // ~1ms at 48MHz Core-Clock
                {
                    __nop();
                }
                val--;
            }
        }

        static inline void EVE_pdn_set(void)
        {
//            GPIO_setOutputLowOnPin(EVE_PDN_PORT,EVE_PDN);   /* Power-Down low */
            P5OUT &= ~EVE_PDN;   /* Power-Down low */
        }

        static inline void EVE_pdn_clear(void)
        {
//            GPIO_setOutputHighOnPin(EVE_PDN_PORT,EVE_PDN);   /* Power-Down high */
            P5OUT |= EVE_PDN;    /* Power-Down high */
        }

        static inline void EVE_cs_set(void)
        {
//            GPIO_setOutputLowOnPin(EVE_CS_PORT,EVE_CS);   /* CS low */
            P5OUT &= ~EVE_CS;   /* CS low */
        }

        static inline void EVE_cs_clear(void)
        {
//            GPIO_setOutputHighOnPin(EVE_CS_PORT,EVE_CS);    /* CS high */
            P5OUT |= EVE_CS;    /* CS high */
        }

        static inline void spi_transmit_async(uint8_t data)
        {
            #if defined (EVE_DMA)

            #else
//            SPI_transmitData(EUSCI_B0_BASE, data);
//            while (!(SPI_getInterruptStatus(EUSCI_B0_BASE,EUSCI_B_SPI_TRANSMIT_INTERRUPT)));

            UCB0TXBUF_SPI = data;
            while(!(UCB0IFG_SPI & UCTXIFG)); /* wait for transmission to complete */
            #endif
        }

        static inline void spi_transmit(uint8_t data)
        {
//            SPI_transmitData(EUSCI_B0_BASE, data);
//            while (!(SPI_getInterruptStatus(EUSCI_B0_BASE,EUSCI_B_SPI_TRANSMIT_INTERRUPT)));

            UCB0TXBUF_SPI = data;
            while(!(UCB0IFG_SPI & UCTXIFG)); /* wait for transmission to complete */
        }

        static inline uint8_t spi_receive(uint8_t data)
        {
//            SPI_transmitData(EUSCI_B0_BASE, data);
//            while (!(SPI_getInterruptStatus(EUSCI_B0_BASE,EUSCI_B_SPI_TRANSMIT_INTERRUPT)));
//            return EUSCI_B_CMSIS(EUSCI_B0_BASE)->RXBUF;

            UCB0TXBUF_SPI = data;
            while(!(UCB0IFG_SPI & UCTXIFG)); /* wait for transmission to complete */
            return UCB0RXBUF_SPI;
         }

        static inline uint8_t fetch_flash_byte(const uint8_t *data)
        {
            return *data;
        }

        #endif /* __MSP432P401R__ */

    #endif /* __TI_ARM */
#endif

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

#if defined (ARDUINO)

	#include <Arduino.h>
	#include <stdio.h>
	#include <SPI.h>

	#define EVE_CS 		5
	#define EVE_PDN		15

	typedef enum _spi_send_flag_t
	{
		SPI_SEND_QUEUED			= 0x00000000,
		SPI_SEND_POLLING		= 0x00000001,
		SPI_SEND_SYNCHRONOUS	= 0x00000002,
		SPI_RESERVED			= 0x00000004,		// reserved
		SPI_RECEIVE				= 0x00000008,
		SPI_CMD_8				= 0x00000010,		// reserved - not yet implemented
		SPI_CMD_16				= 0x00000020,		// reserved - not yet implemented
		SPI_ADDRESS_8			= 0x00000040,		// reserved - not yet implemented
		SPI_ADDRESS_16			= 0x00000080,		// reserved - not yet implemented
		SPI_ADDRESS_24			= 0x00000100,
		SPI_ADDRESS_32			= 0x00000200,		// reserved - not yet implemented
		SPI_MODE_DIO			= 0x00000400,		// reserved - not yet implemented
		SPI_MODE_QIO			= 0x00000800,		// reserved - not yet implemented
		SPI_MODE_DIOQIO_ADDR	= 0x00001000,		// reserved - not yet implemented
	} spi_send_flag_t;

	typedef struct _spi_read_data
	{
		uint8_t _dummy_byte;
		union
		{
			uint8_t 	byte;
			uint16_t	word;
			uint32_t	dword;
		} __attribute__((packed));					// Note: this packing and alignment ensures that the data will be DMA-able
	} spi_read_data __attribute__((aligned(4)));

	// receive data helpers
	#define member_size(type, member) sizeof(((type *)0)->member)

	#define SPI_READ_DUMMY_LEN 	member_size(spi_read_data, _dummy_byte)
	#define SPI_READ_BYTE_LEN 	(SPI_READ_DUMMY_LEN + member_size(spi_read_data, byte))
	#define SPI_READ_WORD_LEN 	(SPI_READ_DUMMY_LEN + member_size(spi_read_data, word))
	#define SPI_READ_DWORD_LEN 	(SPI_READ_DUMMY_LEN + member_size(spi_read_data, dword))


	#define DELAY_MS(ms) delay(ms)

	#if defined (ESP8266)

	#endif

	#if	defined (__AVR__)
		#include <avr/pgmspace.h>
	#endif


	static inline void EVE_pdn_set(void)
	{
		digitalWrite(EVE_PDN, LOW);	/* Power-Down low */
	}

	static inline void EVE_pdn_clear(void)
	{
		digitalWrite(EVE_PDN, HIGH);	/* Power-Down high */
	}

	static inline void EVE_cs_set(void)
	{
		SPI.setDataMode(SPI_MODE0);
		digitalWrite(EVE_CS, LOW);
	}

	static inline void EVE_cs_clear(void)
	{
		digitalWrite(EVE_CS, HIGH);
	}

	static inline void spi_wait_for_pending_transactions()
	{
		// only used to wait for DMA completion, which isn't used in Arduino
	}

	// really should not be inline (too big) but, that's how this project was set up
	static inline void spi_transaction(const uint8_t* data, uint16_t length, spi_send_flag_t flags, spi_read_data* out, uint64_t addr)
	{
		EVE_cs_set();
	
		if(flags & SPI_ADDRESS_24)
		{
			uint8_t addr_bytes[] = { (uint8_t)(addr >> 16), (uint8_t)(addr >> 8), (uint8_t)(addr) };
			SPI.transferBytes(addr_bytes, NULL, sizeof(addr_bytes));
		}

		if(flags & SPI_RECEIVE)
		{
			assert(out != NULL);
			SPI.transferBytes(NULL, (uint8_t*)out, length);
		}
		else
		{
			SPI.transferBytes((uint8_t*)data, NULL, length);
		}
		
		EVE_cs_clear();
	}

#endif /* Arduino */


#endif /* EVE_TARGET_H_ */
